function evenAndOddSubtraction(arr) {
    let even = 0;
    let odd = 0;
    for (let i = 0; i < arr.length; i++) {
         let number = Number(arr[i]);
    }
    for (let number of arr) {
        if (number % 2 === 0) {
            even += number;
        } else {
            odd += number;
        }
    }
    console.log(even - odd);
}
evenAndOddSubtraction([3,5,7,9])

/*1. `let number = Number(arr[i]);`:
   - Създава нова променлива `number`, която получава стойността на `Number(arr[i])`.
   - Променливата `number` съдържа преобразуването на текущия елемент от масива в число, без да променя оригиналната стойност в масива.

2. `arr[i] = Number(arr[i]);`:
   - Променя оригиналната стойност на елемента на индекс `i` в масива, като я заменя с резултата от `Number(arr[i])`.
   - Пълната промяна на елементите в масива с преобразуваните числови стойности.

Общо казано, първият случай (let number = Number(arr[i]);) просто създава временна променлива, която съдържа числовото преобразуване на текущия елемент, без да променя масива.
 Докато вторият случай (arr[i] = Number(arr[i]);) променя оригиналния масив, като преобразува всеки елемент в числова стойност.
 */
